openfoam-adapter_v1.1.0_OpenFOAMv1812-v2112-newer-cht-rework/tutorials/CHT/flow-over-plate/buoyantPimpleFoam-laplacianFoam/Fluid/0.orig/T.default
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    interface
    {
        type            apiCoupledTemperature;
        mode            fixedHeatFlux;

        kappaMethod     fluidThermo;
        kappa           kappa;
        
        value           $internalField;
        refValue        $internalField;
        refGrad         uniform 0;
        valueFraction   uniform 0;
    }
    
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    slip-bottom
    {
        type            zeroGradient;
    }

    outerWall
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
