openfoam-adapter_v1.1.0_OpenFOAMv1812-v2112-newer-cht-rework/tutorials/CHT/flow-over-plate/buoyantPimpleFoam-laplacianFoam/Fluid/system/preciceDict.nearest
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant Fluid;

modules (CHT);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Centers;
    locations         faceCenters;
    connectivity      false;
    patches           (interface);
    
    readData
    (
      Heat-Flux
    );
    
    writeData
    (
    );
  };
  
  Interface2
  {
    mesh              Fluid-Mesh-Nodes;
    locations         faceNodes;
    connectivity      true;
    patches           (interface);
    
    readData
    (
    );
    
    writeData
    (
      Temperature
    );
  };
};